       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA3.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 NUM1              PIC 9  VALUE ZEROES.
       01 NUM2              PIC 9  VALUE ZEROES.
       01 RESULT            PIC 99 VALUE ZEROES.
       01 VARIABLE          PIC X(2) VALUE SPACES.

       PROCEDURE DIVISION.
       0001-INICIO.
           DISPLAY "ENTER FIRST NUMBER (1 DIGIT) : "
           ACCEPT NUM1
           DISPLAY "ENTER SECOND NUMBER (1 DIGIT) : "
           ACCEPT NUM2
           MULTIPLY NUM1 BY NUM2 GIVING RESULT
           DISPLAY "RESULT IS = ", RESULT
           MOVE "COBOL" TO VARIABLE
           DISPLAY VARIABLE
           STOP RUN.
