      *DEMOSTRACION DE FACTORIAL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA6.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FACTORIAL            PIC 9(04) VALUE 1.
       01 NUMERO-USUARIO       PIC 9(03) VALUE ZEROES.
       01 RESULTADO            PIC Z(03)9.

       PROCEDURE DIVISION.
       0001-INICIO.
           DISPLAY "INGRESA EL NUMERO A OBTENER COMO FACTORIAL:"
           ACCEPT NUMERO-USUARIO
           PERFORM 0002-OBTENER-FACTORIAL UNTIL NUMERO-USUARIO EQUAL 1
           MOVE FACTORIAL TO RESULTADO.
           DISPLAY "FACTORIAL ES: ", RESULTADO
           STOP RUN.

       0002-OBTENER-FACTORIAL.
           MULTIPLY FACTORIAL BY NUMERO-USUARIO GIVING FACTORIAL
           SUBTRACT 1 FROM NUMERO-USUARIO
           .
