       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA2.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 STUDENTDETAILS.
           02 SUDENTID      PIC 9(7).
           02 STUDENTNAME.
               03 SURNAME   PIC X(8).
               03 INITIALS  PIC XX.
           02 COURSECODE    PIC X(4).
           02 GENDER        PIC X.

      *YYMMDD
       01 CURRENTDATE.
           02 CURRENTYEAR   PIC 9(4).
           02 CURRENTMONTH  PIC 99.
           02 CURRENTDAY    PIC 99.
      *YYDDD
       01 DAYOFYEAR.
           02 FILLER        PIC 9(4).
           02 YEARDAY       PIC 9(3).

      *hhmmss s=s/100
       01 CURRENTTIME.
           02 CURRENTHOUR   PIC 99.
           02 CURRENTMINUTE PIC 99.
           02 FILLER        PIC 9(4).

       PROCEDURE DIVISION.
       0001-INICIO.
           DISPLAY "ENTER STUDENT DETAILS USING TEMPLATE BELOW"
           DISPLAY "ENTER - ID,SURNAME,INITIAS,COURSECODE,GENDER"
           DISPLAY "SSSSSSSNNNNNNNNIICCCCG"
           ACCEPT STUDENTDETAILS
           ACCEPT CURRENTDATE FROM DATE YYYYMMDD
           ACCEPT DAYOFYEAR FROM DAY YYYYDDD
           ACCEPT CURRENTTIME FROM TIME
           DISPLAY "NAME IS ",INITIALS,SPACE,SURNAME
           DISPLAY "DATE IS ",CURRENTDAY,SPACE,CURRENTMONTH,SPACE,
                   CURRENTYEAR
           DISPLAY "TODAY IS DAY ",YEARDAY," OF THE YEAR".
           DISPLAY "THE TIME IS ", CURRENTHOUR, ":",CURRENTMINUTE.
           STOP RUN.
